// 总结
// 封装组件的思想应该以代码量少，思路清晰，容易上手，只需少量配置即可实现想要的效果
// 将查询条件以配置数组对象的形式传递给子组件，由父组件决定内部的值的取向
// 抽离出相同逻辑，不同逻辑单独文件处理

/**
 * @param
 * 属性                                  作用
 * ---------------------------------------------------------------------------
 * id           |用于渲染时提升渲染效率，需给每个循环的标签给定一个唯一的key(建议传)
 * ---------------------------------------------------------------------------
 * label        |用于字段的说明文字描述，可以是任意值(必须传)
 * ---------------------------------------------------------------------------
 * field        |用于v-model双向绑定字段名称,只能是规范的变量(必传项)
 * ---------------------------------------------------------------------------
 * isPlain      |用于判断当前字段属于什么类型的录入框(普通输入框,普通输入框必传)
 * ---------------------------------------------------------------------------
 * isDateRange  |同上(日期范围选框,日期范围选择必传)
 * ---------------------------------------------------------------------------
 * isDate       |同上(单选日期选框,单选日期必传)
 * ---------------------------------------------------------------------------
 * isSelect     |同上(下拉框必传)
 * ---------------------------------------------------------------------------
 * option       |用于下拉框数据枚举数组(只能是一个数组,下拉框必传)
 * ---------------------------------------------------------------------------
 * selectLabel  |用于下拉框选择时枚举的文字说明(下拉框必传)
 * ---------------------------------------------------------------------------
 * selectValue  |用于下拉框选择时枚举的真实取值,与最终字段录入相关(下拉框必传)
 * ---------------------------------------------------------------------------
 * 此后需要自行添加,上面说明仅供参考
 */

export const dataArr = [
  { id: 3, label: "内采合同号", field: "purchaseNo", isPlain: true },
  { id: 4, label: "仓库", field: "wareLoc", isPlain: true },
  { id: 5, label: "制单日期", field: "wareDateRange", isDateRange: true },
  {
    id: 7,
    label: "入库状态",
    // label: "库存状态",
    field: "cFlag",
    option: "cFlagList",
    selectLabel: "label",
    selectValue: "value",
    isSelect: true
  },
  // {
  //   id: 7,
  //   label: "验收状态",
  //   field: "ysFlag",
  //   option: "ysFlagList",
  //   selectLabel: "refValue",
  //   selectValue: "refValueCode",
  //   isSelect: true
  // },
  { id: 6, label: "入库单号", field: "wareHsNo", isPlain: true },
  { id: 2, label: "部门", field: "orgName", isPlain: true },
  { id: 1, label: "业务员", field: "employeeName", isPlain: true },
  {
    id: 8,
    label: "审批状态",
    field: "auditStatus",
    option: "auditStatusList",
    selectLabel: "statusName",
    selectValue: "statusCode",
    isSelect: true
  }
];
